cask_args appdir: "~/Applications" , require_sha: true
brew "asdf"
brew "autoconf"
brew "aws-elasticbeanstalk"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cmake"
brew "claude-code-router"
brew "colima"
brew "colordiff"
brew "direnv"
brew "fabric-ai"
brew "ffmpeg"
brew "fzf"
brew "gemini-cli"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "lazysql"
brew "libpq"
brew "magic-wormhole"
brew "neovim"
brew "openssl"
brew "podman"
brew "podman-compose"
brew "rcm"
brew "ripgrep"
brew "sqlite3"
brew "starship"
brew "tig"
brew "tree-sitter"
brew "tree-sitter-cli"
brew "tmux"
brew "tree"
brew "vim"
brew "watch"
brew "wget"
brew "watchexec"
brew "wxwidgets"
brew "xsv"
brew "yt-dlp"
brew "zoxide"

cask "antigravity"
cask "beekeeper-studio"
cask "bruno"
cask "chromedriver"
cask "claude-code"
cask "ghostty"
cask "karabiner-elements"
cask "salesforce-cli"
cask "keybase"
cask "mark-text"
cask "mitmproxy"
cask "raycast"
cask "rectangle-pro"
cask "vial"
cask "viscosity"
cask "visual-studio-code"
