tap "homebrew/bundle" 
tap "heroku/brew" 
tap "homebrew/cask" 
tap "homebrew/core" 
tap "helix-editor/helix"
tap "yt-dlp/taps"
tap "puma/puma"
tap "ekvedaras/homebrew-cask"

cask_args appdir: "~/Applications", require_sha: true
brew "ansible"
brew "autoconf"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "cmake"
brew "colima"
brew "colordiff"
brew "direnv"
brew "docker"
brew "emacs"
brew "fd"
brew "ffmpeg"
brew "gawk"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "htop"
brew "jq"
brew "lazygit"
brew "libpq"
brew "magic-wormhole"
brew "mysql-client"     
brew "neovim"
brew "openssl"
brew "pandoc"
brew "podman"
brew "prettier"
brew "puma-dev"
brew "pwgen"
brew "rcm"
brew "restic"
brew "ripgrep"
brew "scrcpy"
brew "sqlite3"
brew "starship"
brew "svn"
brew "teleport"
brew "tig"
brew "tmux"
brew "tree"
brew "vault"
brew "wget"
brew "wxwidgets"
brew "xsv"
brew "youtube-dl"
brew "yt-dlp"
brew "zbar"

cask "android-studio"
cask "cyberduck"
cask "discord"
cask "emacs"
cask "google-chrome"
cask "keybase"
cask "lark"
cask "logseq"
cask "maestral"
cask "mark-text"
cask "mountain-duck"
cask "multipass"
cask "obsidian"
cask "pgadmin4"
cask "rectangle-pro"
cask "redis-gui"
cask "slack"
cask "sublime-text"
cask "the-unarchiver"
cask "tuple"
cask "typora"
cask "via"
cask "viscosity"
cask "visual-studio-code"
cask "vscodium"
cask "warp"
cask "wechat"
cask "zoom"
