tap "homebrew/bundle" 
tap "heroku/brew" 
tap "homebrew/cask" 
tap "homebrew/core" 
tap "helix-editor/helix"
tap "yt-dlp/taps"
tap "puma/puma"
tap "ekvedaras/homebrew-cask"
tap "d12frosted/emacs-plus"
tap "buo/cask-upgrade"

cask_args appdir: "~/Applications", require_sha: true
brew "ansible"
brew "autoconf"
brew "aria2"
brew "aws-vault"
brew "awscli"
brew "bat"
brew "certbot"
brew "cmake"
brew "codespell"
brew "colima"
brew "colordiff"
brew "direnv"
brew "docker"
brew "earthly"
brew "emacs"
brew "exercism"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gawk"
brew "gnu-sed"
brew "gnu-time"
brew "gnupg"
brew "grep"
brew "helix"
brew "helm"
brew "htop"
brew "jq"
brew "lazygit"
brew "libpq"
brew "lux"
brew "k9s"
brew "magic-wormhole"
brew "mailhog"
brew "mitmproxy"
brew "mysql-client"     
brew "neovim"
brew "openssl"
brew "openstackclient"
brew "pandoc"
brew "pcre"
brew "peco"
brew "prettier"
brew "puma-dev"
brew "pwgen"
brew "rcm"
brew "restic"
brew "ripgrep"
brew "scrcpy"
brew "shellcheck"
brew "sqlite3"
brew "starship"
brew "svn"
brew "teleport"
brew "tig"
brew "tmux"
brew "tmuxp"
brew "tree"
brew "vault"
brew "vim"
brew "wget"
brew "wxwidgets"
brew "xsv"
brew "youtube-dl"
brew "yt-dlp"
brew "zbar"
brew "zellij"

cask "alacritty"
cask "android-studio"
cask "balenaetcher"
cask "brave-browser"
cask "cyberduck"
cask "chromedriver"
cask "discord"
cask "emacs"
cask "google-chrome"
cask "keybase"
cask "keycastr"
cask "kitty"
cask "krita"
cask "lapce"
cask "lark"
cask "logseq"
cask "maestral"
cask "mark-text"
cask "microsoft-edge"
cask "microsoft-teams"
cask "mountain-duck"
cask "mullvad-browser"
cask "multipass"
cask "neovide"
cask "obsidian"
cask "orbstack"
cask "pgadmin4"
cask "pop"
cask "rectangle-pro"
cask "reqable"
cask "sequel-pro"
cask "slack"
cask "sublime-text"
cask "tailscale"
cask "the-unarchiver"
cask "tuple"
cask "typora"
cask "unetbootin"
cask "via"
cask "viscosity"
cask "visual-studio-code"
cask "voov-meeting"
cask "vscodium"
cask "warp"
cask "wechat"
cask "wkhtmltopdf"
cask "zed"
cask "zoom"
