tap "heroku/brew"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
# tap "homebrew/drivers"
tap "homebrew/services"
# tap "wallix/awless"
tap "tako8ki/tap"

cask_args appdir: "~/Applications", require_sha: true

brew "ack"
brew "amp"
brew "ansible"
brew "aria2"
brew "asciinema"
brew "autoconf"
# brew "awless"
brew "awscli"
brew "azure-cli"
brew "bat"
brew "bmon"
brew "bpytop"
brew "cmake"
brew "cocoapods"
brew "colordiff"
brew "coreutils"
brew "ctags"
brew "direnv"
brew "docker-compose"
brew "dog"
brew "eksctl"
brew "emacs"
brew "eugenmayer/dockersync/unox"
brew "exa"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gcc"
brew "gettext"
brew "git"
brew "git-delta"
brew "git-hooks"
brew "gnu-sed"
brew "gnu-tar"
brew "gnupg"
brew "gnutls"
brew "gobang"
brew "graphviz"
brew "gzip"
brew "helm"
brew "htop"
brew "imagemagick"
brew "jq"
brew "libtool"
brew "libxml2"
brew "libxslt"
brew "lima"
brew "localstack"
brew "magic-wormhole"
brew "mas"
brew "mitmproxy"
brew "mysql-client"     
brew "neovim"
brew "openstackclient"
brew "p7zip"
brew "pandoc"
brew "plantuml"
brew "podman"
brew "procs"
brew "pwgen"
brew "rcm"
brew "reattach-to-user-namespace"
brew "restic"
brew "ripgrep"
brew "starship"
brew "spotify-tui"
brew "spotifyd"
brew "sqlite3"
brew "teleport"
brew "texinfo"
brew "tig"
brew "tmux"
brew "tmuxinator"
brew "tree"
brew "unison"
brew "vault"
brew "wget"
# brew "wxmac"
brew "xsv"
brew "youtube-dl"
brew "zplug"
brew "zsh"

## Cask
cask "1password"
cask "alacritty"
cask "alfred"
cask "amethyst"
cask "android-studio"
cask "beekeeper-studio"
cask "caffeine"
cask "cyberduck"
cask "db-browser-for-sqlite"
cask "discord"
cask "docker"
cask "dropbox"
cask "emacs"
cask "firefox"
cask "google-chrome"
cask "insomnia"
cask "iina"
cask "iterm2"
cask "kitty"
cask "loom"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "microsoft-teams"
cask "ngrok"
cask "notion"
cask "obsidian"
cask "omnidb"
cask "opera"
cask "pgadmin4"
cask "postman"
# cask "qmk-toolbox"
cask "sublime-text"
cask "spectacle"
cask "skype"
cask "sequel-pro"
cask "tencent-meeting"
cask "typora"
cask "vagrant"
cask "via"
cask "virtualbox"
cask "viscosity"
cask "vlc"
cask "vscodium"
cask "wechat"
cask "zettlr"
cask "zoom"

## DB
# brew "postgresql@11", restart_service: true
# brew "redis", restart_service: true

